l1 = [1, 2, 'jimmy', [1, 'conan', 3,]]
# 1, 将l1中的'jimmy'变成大写并放回原处。
l1[2] = l1[2].upper()
print(l1)

# 2，给小列表[1,'conan',3,]追加一个元素,'兰'。
l1[-1].append('兰')
print(l1)

# 3，将列表中的'conan'通过字符串拼接的方式在列表中变成'conannb'
l1[-1][1] += 'nb'
print(l1)


lis = [2, 30, "k", ["qwe", 20, ["k1", ["tt", 3, "1"]], 89], "ab", "adv"]
# 将列表lis中的"tt"变成大写
lis[3][2][1][0] = lis[3][2][1][0].upper()
print(lis)

# 将列表中的数字3变成字符串"100"（用两种方式）。
lis[3][2][1][1] = str(lis[3][2][1][1] + 97)
print(lis)

# 将列表中的字符串"1"变成数字101（用两种方式）。
lis[3][2][1][-1] = int(lis[3][2][1][-1]) + 100
print(lis)
